org/fp-in-js.org
* Continuations
  Callbacks represent a concept of /continuations/.
  The main problem with callbacks is that they do not compose - that causes to lose insight into the program flow.

** Functors
# *** Future
  In Scala, for example, continuation-passing style can be executed by means of *Futures*.
  An example implementation of a Future in JS can look like so:
  
  #+begin_src javascript
class Future {
    constructor() {
        this.slots = [];
        this.completed = false;
    }

    // ready :: Future a -> (a -> b) -> ()
    ready(fn) {
        if(this.completed) {
            fn(this.value);
        } else {
            this.slots.push(fn);
        }
    }

    // complete :: Future a -> a -> ()
    complete(val) {
        if(this.completed) {
            throw new Error('Cannot complete an already completed Future!');
        }

        this.value = val;
        this.completed = true;
        this.slots.forEach(fn => fn(this.value));
        // Release the slots from memory.
        this.slots = null;
    }

    // map :: Future a -> (b -> c) -> Future c
    map(fn) {
        const future = new Future();
        this.ready(val => future.complete(fn(val)));
        return future;
    }

    // unit :: a -> Future a
    static unit(val) {
        const future = new Future();
        future.complete(val);
        return future;
    }

    // delay :: a -> Int -> Future a
    static delay(val, millis) {
        const future = new Future();
        setTimeout(()=>{
            future.complete(val);
        }, millis);
        return future;
    }

}
  #+end_src

  Having such a tool, we can compose our asynchronous computations with different aspects.
  
  #+begin_src javascript
// logF :: Future a -> ()
function logF(f) {
    f.ready(::console.log);
    return f;
}
  #+end_src

  An important thing about the Future and the concept it represents is that it always denotes an immutable value.
  The completion values cannot be changed.

  An example of lifting the =fs.readFile= function into Future:
  
#+begin_src javascript
// readFileF :: String -> Object -> Future String
function readFileF(file, options) {
    const f = new Future();
    fs.readFile(file, options, function(err, data){
        if(err) throw err;
        f.complete(data);
    });

    return f;
}
#+end_src

  A very useful function on Future is =map=, which allows to compose a value transformation onto a Future instance.
  Note that, for example, Array also can be =map= ped over.

  Generally, if you are able to =map= over something, it means that it is a *Functor*.
  The name comes from the fact that a Functor takes a function, applies it to the contained value and returns another instance representing the transformation result.

