fp-in-js.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4db8709">1. Continuations</a>
<ul>
<li><a href="#org1f4f993">1.1. Functors</a>
<ul>
<li><a href="#org45e2116">1.1.1. Lifting</a></li>
</ul>
</li>
<li><a href="#orge0ed603">1.2. Monads</a>
<ul>
<li><a href="#org4a1a8a9">1.2.1. Lifting functions with arity &gt; 1</a>
<ul>
<li><a href="#orgc390641">1.2.1.1. <span class="todo TODO">TODO</span> How to express variadic functions correctly in HM notation?</a></li>
</ul>
</li>
<li><a href="#org8f268d7">1.2.2. Error handling</a></li>
<li><a href="#org0bd8787">1.2.3. Side effects</a></li>
<li><a href="#org8a1679e">1.2.4. Aside: promises</a></li>
<li><a href="#org4e8e3ba">1.2.5. <span class="todo TODO">TODO</span> Applicative Functors</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org81af103">2. Followups</a>
<ul>
<li><a href="#orgad5f1df">2.1. <span class="done DONE">DONE</span> </a></li>
<li><a href="#org8d8d83c">2.2. <span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4db8709" class="outline-2">
<h2 id="org4db8709"><span class="section-number-2">1</span> Continuations</h2>
<div class="outline-text-2" id="text-1">
<p>
Callbacks represent a concept of <i>continuations</i>.
The main problem with callbacks is that they do not compose - that causes to lose insight into the program flow.
</p>
</div>

<div id="outline-container-org1f4f993" class="outline-3">
<h3 id="org1f4f993"><span class="section-number-3">1.1</span> Functors</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In Scala, for example, continuation-passing style can be executed by means of <b>Futures</b>.
An example implementation of a Future in JS can look like so:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">class</span> Future <span style="color: #c5c8c6;">{</span>
    constructor<span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #81a2be;">this</span>.slots = <span style="color: #f0c674;">[]</span>;
        <span style="color: #81a2be;">this</span>.completed = <span style="color: #81a2be;">false</span>;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">ready :: Future a -&gt; (a -&gt; b) -&gt; ()</span>
    ready<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">if</span><span style="color: #f0c674;">(</span><span style="color: #81a2be;">this</span>.completed<span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
            fn<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.value<span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span> <span style="color: #b5bd68;">else</span> <span style="color: #f0c674;">{</span>
            <span style="color: #81a2be;">this</span>.slots.push<span style="color: #b5bd68;">(</span>fn<span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">complete :: Future a -&gt; a -&gt; ()</span>
    complete<span style="color: #8abeb7;">(</span>val<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">if</span><span style="color: #f0c674;">(</span><span style="color: #81a2be;">this</span>.completed<span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">throw</span> <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Error</span><span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'Cannot complete an already completed Future!'</span><span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>

        <span style="color: #81a2be;">this</span>.value = val;
        <span style="color: #81a2be;">this</span>.completed = <span style="color: #81a2be;">true</span>;
        <span style="color: #81a2be;">this</span>.slots.forEach<span style="color: #f0c674;">(</span>fn =&gt; fn<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.value<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;
        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Release the slots from memory.</span>
        <span style="color: #81a2be;">this</span>.slots = <span style="color: #81a2be;">null</span>;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">map :: Future a -&gt; (b -&gt; c) -&gt; Future c</span>
    map<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #f0c674;">()</span>;
        <span style="color: #81a2be;">this</span>.ready<span style="color: #f0c674;">(</span>val =&gt; future.complete<span style="color: #b5bd68;">(</span>fn<span style="color: #81a2be;">(</span>val<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;
        <span style="color: #b5bd68;">return</span> future;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">unit :: a -&gt; Future a</span>
    <span style="color: #b5bd68;">static</span> unit<span style="color: #8abeb7;">(</span>val<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #f0c674;">()</span>;
        future.complete<span style="color: #f0c674;">(</span>val<span style="color: #f0c674;">)</span>;
        <span style="color: #b5bd68;">return</span> future;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">delay :: a -&gt; Int -&gt; Future a</span>
    <span style="color: #b5bd68;">static</span> delay<span style="color: #8abeb7;">(</span>val, millis<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #f0c674;">()</span>;
        setTimeout<span style="color: #f0c674;">(</span><span style="color: #b5bd68;">()</span>=&gt;<span style="color: #b5bd68;">{</span>
            future.complete<span style="color: #81a2be;">(</span>val<span style="color: #81a2be;">)</span>;
        <span style="color: #b5bd68;">}</span>, millis<span style="color: #f0c674;">)</span>;
        <span style="color: #b5bd68;">return</span> future;
    <span style="color: #8abeb7;">}</span>

<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
Having such a tool, we can compose our asynchronous computations with different aspects.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">logF :: Future a -&gt; ()</span>
<span style="color: #b5bd68;">function</span> <span style="color: #de935f;">logF</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">f</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
    f.ready<span style="color: #8abeb7;">(</span>::console.log<span style="color: #8abeb7;">)</span>;
    <span style="color: #b5bd68;">return</span> f;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
An important thing about the Future and the concept it represents is that it always denotes an immutable value.
The completion values cannot be changed.
</p>

<p>
An example of lifting the <code>fs.readFile</code> function into Future:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">readFileF :: String -&gt; Object -&gt; Future String</span>
<span style="color: #b5bd68;">function</span> <span style="color: #de935f;">readFileF</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">file</span>, <span style="color: #f0c674;">options</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">f</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #8abeb7;">()</span>;
    fs.readFile<span style="color: #8abeb7;">(</span>file, options, <span style="color: #b5bd68;">function</span><span style="color: #f0c674;">(</span><span style="color: #f0c674;">err</span>, <span style="color: #f0c674;">data</span><span style="color: #f0c674;">){</span>
        <span style="color: #b5bd68;">if</span><span style="color: #b5bd68;">(</span>err<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">throw</span> err;
        f.complete<span style="color: #b5bd68;">(</span>data<span style="color: #b5bd68;">)</span>;
    <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;

    <span style="color: #b5bd68;">return</span> f;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
A very useful function on Future is <code>map</code>, which allows to compose a value transformation onto a Future instance.
Note that, for example, Array also can be <code>map</code> ped over.
</p>

<p>
Generally, if you are able to <code>map</code> over something, it means that it is a <b>Functor</b>.
The name comes from the fact that a Functor takes a function, applies it to the contained value and returns another instance representing the transformation result.
</p>
</div>
