org/fp-in-js.org
*** Lifting
    We can extract the lift operation (as what was done to the =fs.readFile= function) as a first-class citizen.
    Let's take an example of measuring the length of the result of a Future.
    
    #+begin_src javascript
// lengthF :: Future a -> Future Int
function lengthF(f) {
    const resultF = new Future();
    f.ready(val => resultF.complete(val.length));
    return resultF;
}
    #+end_src

    Now we see some duplication - a sign that some deeper laws are at work here.

#+begin_src javascript
// lift1 :: (a -> b) -> Future a -> Future b
Future.lift1 = fn => fut => fut.map(fn);

let lengthF = Future.lift1(result => result.length);
#+end_src

    The name =lift1= corresponds to the arity of the function taken as input.

** Monads

   Does Future constitute the same meaning for all types that reside within it?
   What about =Future Future=?

   An example that will be worked on here is that of inspecting a directory and then reading the content of the first file within it.
   
#+begin_src javascript
import fs from 'fs';

// readDirF :: String -> Future [String]
function readDirF(path) {
    const future = new Future();
    fs.readdir(path, (err, files) => {
        if(err) throw err;
        future.complete(files);
    });

    return future;
}
#+end_src

   We can see that trying to just map over the first future with another one, trying to get the length does not work.
   
#+begin_src javascript
logF(readDirF('foo')
     .map(files => ReadFileF(files[0])));
// {slots []}
#+end_src

   It just returns the second Future.
   We need to /respect/ the fact that the first Future has to do what it needs to before we can transform its result.
   The function to watch for this looks thusly:
   
#+begin_src javascript
// flatten :: Future Future a -> Future a
Future.prototype.flatten = () => {
    const future1 = new Future();
    this.ready(future2 => future2.ready(val => future1.complete(val)));
    return future1;
};
#+end_src

   Having this, we can achieve our original goal, albeit the result is a bit clunky:
   
   #+begin_src javascript
const result = readDirF("testdir")
               .fmap( files => readFileF(files[0], {encoding: 'utf8'}));

logF( result.flatten() )
   #+end_src

   Conceptually, we have just /sequenced/ two asynchronous computations.
   This is a very powerful concepts and one of the core features of a *Monad*.
   It should also be expressed as a first-class citizen.

   
   #+begin_src javascript
// flatMap :: Future a -> (a -> Future b) -> Future b
Future.prototype.flatMap = function(fn) {
    return this.map(fn).flatten();
};
   #+end_src

   The idiomatic way to fulfill the example's goal is:
   
#+begin_src javascript
logF(readDirF("testdir")
     .flatMap(files => readFileF(files[0], {
         encoding: 'utf8'
     })));
#+end_src

   What a type needs to fulfill the Monad interface is:
   - A way to lift normal values to Monadic ones such as =Future.unit=.
   - A way of chaining (sequencing) 2 consecutive Monadic operations - each monad can have its own chaining logic.
     Here, the logic is handled with =flatMap= which waits for a Future to complete.

