fp-in-js.html

<div id="outline-container-org45e2116" class="outline-4">
<h4 id="org45e2116"><span class="section-number-4">1.1.1</span> Lifting</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
We can extract the lift operation (as what was done to the <code>fs.readFile</code> function) as a first-class citizen.
Let's take an example of measuring the length of the result of a Future.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">lengthF :: Future a -&gt; Future Int</span>
<span style="color: #b5bd68;">function</span> <span style="color: #de935f;">lengthF</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">f</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">resultF</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #8abeb7;">()</span>;
    f.ready<span style="color: #8abeb7;">(</span>val =&gt; resultF.complete<span style="color: #f0c674;">(</span>val.length<span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span>;
    <span style="color: #b5bd68;">return</span> resultF;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
Now we see some duplication - a sign that some deeper laws are at work here.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">lift1 :: (a -&gt; b) -&gt; Future a -&gt; Future b</span>
Future.lift1 = fn =&gt; fut =&gt; fut.map<span style="color: #c5c8c6;">(</span>fn<span style="color: #c5c8c6;">)</span>;

<span style="color: #b5bd68;">let</span> <span style="color: #f0c674;">lengthF</span> = Future.lift1<span style="color: #c5c8c6;">(</span>result =&gt; result.length<span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
The name <code>lift1</code> corresponds to the arity of the function taken as input.
</p>
</div>
</div>
</div>

<div id="outline-container-orge0ed603" class="outline-3">
<h3 id="orge0ed603"><span class="section-number-3">1.2</span> Monads</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Does Future constitute the same meaning for all types that reside within it?
What about <code>Future Future</code>?
</p>

<p>
An example that will be worked on here is that of inspecting a directory and then reading the content of the first file within it.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">import</span> fs from <span style="color: #8abeb7;">'fs'</span>;

<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">readDirF :: String -&gt; Future [String]</span>
<span style="color: #b5bd68;">function</span> <span style="color: #de935f;">readDirF</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">path</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #8abeb7;">()</span>;
    fs.readdir<span style="color: #8abeb7;">(</span>path, <span style="color: #f0c674;">(</span>err, files<span style="color: #f0c674;">)</span> =&gt; <span style="color: #f0c674;">{</span>
        <span style="color: #b5bd68;">if</span><span style="color: #b5bd68;">(</span>err<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">throw</span> err;
        future.complete<span style="color: #b5bd68;">(</span>files<span style="color: #b5bd68;">)</span>;
    <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;

    <span style="color: #b5bd68;">return</span> future;
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
We can see that trying to just map over the first future with another one, trying to get the length does not work.
</p>

<div class="org-src-container">
<pre class="src src-javascript">logF<span style="color: #c5c8c6;">(</span>readDirF<span style="color: #8abeb7;">(</span><span style="color: #8abeb7;">'foo'</span><span style="color: #8abeb7;">)</span>
     .map<span style="color: #8abeb7;">(</span>files =&gt; ReadFileF<span style="color: #f0c674;">(</span>files<span style="color: #b5bd68;">[</span><span style="color: #81a2be;">0</span><span style="color: #b5bd68;">]</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>;
<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">{slots []}</span>
</pre>
</div>

<p>
It just returns the second Future.
We need to <i>respect</i> the fact that the first Future has to do what it needs to before we can transform its result.
The function to watch for this looks thusly:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">flatten :: Future Future a -&gt; Future a</span>
Future.<span style="color: #81a2be;">prototype</span>.flatten = <span style="color: #c5c8c6;">()</span> =&gt; <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future1</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #8abeb7;">()</span>;
    <span style="color: #81a2be;">this</span>.ready<span style="color: #8abeb7;">(</span>future2 =&gt; future2.ready<span style="color: #f0c674;">(</span>val =&gt; future1.complete<span style="color: #b5bd68;">(</span>val<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span>;
    <span style="color: #b5bd68;">return</span> future1;
<span style="color: #c5c8c6;">}</span>;
</pre>
</div>

<p>
Having this, we can achieve our original goal, albeit the result is a bit clunky:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">result</span> = readDirF<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">"testdir"</span><span style="color: #c5c8c6;">)</span>
               .fmap<span style="color: #c5c8c6;">(</span> files =&gt; readFileF<span style="color: #8abeb7;">(</span>files<span style="color: #f0c674;">[</span><span style="color: #81a2be;">0</span><span style="color: #f0c674;">]</span>, <span style="color: #f0c674;">{</span>encoding: <span style="color: #8abeb7;">'utf8'</span><span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>;

logF<span style="color: #c5c8c6;">(</span> result.flatten<span style="color: #8abeb7;">()</span> <span style="color: #c5c8c6;">)</span>
</pre>
</div>

<p>
Conceptually, we have just <i>sequenced</i> two asynchronous computations.
This is a very powerful concepts and one of the core features of a <b>Monad</b>.
It should also be expressed as a first-class citizen.
</p>


<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">flatMap :: Future a -&gt; (a -&gt; Future b) -&gt; Future b</span>
Future.<span style="color: #81a2be;">prototype</span>.flatMap = <span style="color: #b5bd68;">function</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">fn</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #81a2be;">this</span>.map<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span>.flatten<span style="color: #8abeb7;">()</span>;
<span style="color: #c5c8c6;">}</span>;
</pre>
</div>

<p>
The idiomatic way to fulfill the example's goal is:
</p>

<div class="org-src-container">
<pre class="src src-javascript">logF<span style="color: #c5c8c6;">(</span>readDirF<span style="color: #8abeb7;">(</span><span style="color: #8abeb7;">"testdir"</span><span style="color: #8abeb7;">)</span>
     .flatMap<span style="color: #8abeb7;">(</span>files =&gt; readFileF<span style="color: #f0c674;">(</span>files<span style="color: #b5bd68;">[</span><span style="color: #81a2be;">0</span><span style="color: #b5bd68;">]</span>, <span style="color: #b5bd68;">{</span>
         encoding: <span style="color: #8abeb7;">'utf8'</span>
     <span style="color: #b5bd68;">}</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
What a type needs to fulfill the Monad interface is:
</p>
<ul class="org-ul">
<li>A way to lift normal values to Monadic ones such as <code>Future.unit</code>.</li>
<li>A way of chaining (sequencing) 2 consecutive Monadic operations - each monad can have its own chaining logic.
Here, the logic is handled with <code>flatMap</code> which waits for a Future to complete.</li>
</ul>
</div>
