org/fp-in-js.org
*** Lifting functions with arity > 1

    Naively, one could implement lifting functions for different arities.
    
#+begin_src javascript
// lift2 :: (a->b->c) -> (Future a -> Future b -> Future c)
Future.lift2 = function(fn) {
    return (f1, f2) =>
        f1.flatMap(value1 =>
            f2.flatMap(value2 =>
                Future.unit(fn(value1, value2))
            )
        );
};

// and so on...
#+end_src

    Note that the first operation doesn't really do anything - it just provides a scope for the result of the first Future.
    An interesting property becomes visible if we put this into action:
    
#+begin_src javascript
var concat2F = Future.lift2( (str1, str2) => str1+' '+str2 );
var text1F = readFileF('test1.txt', {encoding: 'utf8'});
var text2F = readFileF('test2.txt', {encoding: 'utf8'});
log( concat2F(text1F, text2F) );
#+end_src

    Note that the multi-argument function does not depend on the order of completion of its inputs or on their interdependence.
    It can be stated that

    #+BEGIN_QUOTE
    *If* =map= denotes a single operation
    *and* =flatMap= denotes sequential operations
    *then* multi-argument lifted functions denote /parallel/ operations.
    #+END_QUOTE

    Practically - we run all Futures at once and wait for their completion.
    A variadic lifting function looks like so.
    
    #+begin_src javascript
// MISSING TYPE DECLARATION!
Future.lift = fn => {
    return (...args) => {
        let bindArg = (index, values) => {
            return args[index].flatMap(val => {
                values = values.concat(val);
                if (index < args.length - 1) {
                    return bindArg(index + 1, values);
                }

                return Future.unit(fn.apply(this, values));
            });
        };

        return bindArg(0, []);
    };
};
    #+end_src

    N-ary lifting can also be implemented via an Applicative Functor.
    
**** TODO How to express variadic functions correctly in HM notation?
