fp-in-js.html

<div id="outline-container-org4a1a8a9" class="outline-4">
<h4 id="org4a1a8a9"><span class="section-number-4">1.2.1</span> Lifting functions with arity &gt; 1</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Naively, one could implement lifting functions for different arities.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">lift2 :: (a-&gt;b-&gt;c) -&gt; (Future a -&gt; Future b -&gt; Future c)</span>
Future.lift2 = <span style="color: #b5bd68;">function</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">fn</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">(</span>f1, f2<span style="color: #8abeb7;">)</span> =&gt;
        f1.flatMap<span style="color: #8abeb7;">(</span>value1 =&gt;
            f2.flatMap<span style="color: #f0c674;">(</span>value2 =&gt;
                Future.unit<span style="color: #b5bd68;">(</span>fn<span style="color: #81a2be;">(</span>value1, value2<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>
            <span style="color: #f0c674;">)</span>
        <span style="color: #8abeb7;">)</span>;
<span style="color: #c5c8c6;">}</span>;

<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">and so on...</span>
</pre>
</div>

<p>
Note that the first operation doesn't really do anything - it just provides a scope for the result of the first Future.
An interesting property becomes visible if we put this into action:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">concat2F</span> = Future.lift2<span style="color: #c5c8c6;">(</span> <span style="color: #8abeb7;">(</span>str1, str2<span style="color: #8abeb7;">)</span> =&gt; str1+<span style="color: #8abeb7;">' '</span>+str2 <span style="color: #c5c8c6;">)</span>;
<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">text1F</span> = readFileF<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'test1.txt'</span>, <span style="color: #8abeb7;">{</span>encoding: <span style="color: #8abeb7;">'utf8'</span><span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
<span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">text2F</span> = readFileF<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'test2.txt'</span>, <span style="color: #8abeb7;">{</span>encoding: <span style="color: #8abeb7;">'utf8'</span><span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
log<span style="color: #c5c8c6;">(</span> concat2F<span style="color: #8abeb7;">(</span>text1F, text2F<span style="color: #8abeb7;">)</span> <span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
Note that the multi-argument function does not depend on the order of completion of its inputs or on their interdependence.
It can be stated that
</p>

<blockquote>
<p>
<b>If</b> <code>map</code> denotes a single operation
<b>and</b> <code>flatMap</code> denotes sequential operations
<b>then</b> multi-argument lifted functions denote <i>parallel</i> operations.
</p>
</blockquote>

<p>
Practically - we run all Futures at once and wait for their completion.
A variadic lifting function looks like so.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">MISSING TYPE DECLARATION!</span>
Future.lift = fn =&gt; <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">(</span>...args<span style="color: #8abeb7;">)</span> =&gt; <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">let</span> <span style="color: #f0c674;">bindArg</span> = <span style="color: #f0c674;">(</span>index, values<span style="color: #f0c674;">)</span> =&gt; <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">return</span> args<span style="color: #b5bd68;">[</span>index<span style="color: #b5bd68;">]</span>.flatMap<span style="color: #b5bd68;">(</span>val =&gt; <span style="color: #81a2be;">{</span>
                values = values.concat<span style="color: #c5c8c6;">(</span>val<span style="color: #c5c8c6;">)</span>;
                <span style="color: #b5bd68;">if</span> <span style="color: #c5c8c6;">(</span>index &lt; args.length - <span style="color: #81a2be;">1</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
                    <span style="color: #b5bd68;">return</span> bindArg<span style="color: #8abeb7;">(</span>index + <span style="color: #81a2be;">1</span>, values<span style="color: #8abeb7;">)</span>;
                <span style="color: #c5c8c6;">}</span>

                <span style="color: #b5bd68;">return</span> Future.unit<span style="color: #c5c8c6;">(</span>fn.apply<span style="color: #8abeb7;">(</span><span style="color: #81a2be;">this</span>, values<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>;
            <span style="color: #81a2be;">}</span><span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>;

        <span style="color: #b5bd68;">return</span> bindArg<span style="color: #f0c674;">(</span><span style="color: #81a2be;">0</span>, <span style="color: #b5bd68;">[]</span><span style="color: #f0c674;">)</span>;
    <span style="color: #8abeb7;">}</span>;
<span style="color: #c5c8c6;">}</span>;
</pre>
</div>

<p>
N-ary lifting can also be implemented via an Applicative Functor.
</p>
</div>

<div id="outline-container-orgc390641" class="outline-5">
<h5 id="orgc390641"><span class="section-number-5">1.2.1.1</span> <span class="todo TODO">TODO</span> How to express variadic functions correctly in HM notation?</h5>
</div>
</div>
