org/fp-in-js.org
*** Error handling
     Instead of throwing the error in =readFileF= and =readDirF=, the Future could be augmented with means of expressing failure.
     Note that the failure handling logic has to be implemented in all primitive combinators.
     
#+begin_src javascript
class Future {
    constructor() {
        this.completeSlots = [];
        this.failSlots = [];
        this.completed = false;
        this.failed = false;
    }

    /* ... */

    failed(fn) {
        if (this.failed) {
            fn(this.error);
        } else {
            this.failSlots.push(fn);
        }
    }

    fail(err) {
        if(this.completed || this.failed) {
            throw new Error('Cannot fail an already settled Future!');
        }

        this.failed = true;
        this.error = err;
        this.failSlots.forEach(fn => fn(err));
        this.failSlots = null;
        this.slots = null;
    }

    map(fn) {
        const future = new Future();
        this.ready(val => {
            try {
                future.complete(fn(val));
            } catch(err) {
                future.fail(err);
            }
        });

        this.failed(err => future.fail(err));
        return future;
    }

    flatten() {
        const future1 = new Future();

        // If outer fails, we don't care about the result of inner.
        this.failed(err => future1.fail(err));

        // If inner fails, we need to fail the result.
        this.ready(future2 => future2.failed(err => future1.fail(err)));

        // Happy case.
        this.ready(future2 => future2.ready(val => future1.complete(val)));

        return future1;
    }
}
#+end_src

     What can we do with a failed Future?
     There is actually only one thing - we can /catch/ the errors and try to recover from them.

#+begin_src javascript
// recover :: Future a|Error -> (Error -> b|Error) -> Future b|Error
Future.prototype.recover = fn => {
    const future = new Future();

    this.ready(val => future.complete(val));

    this.failed(err => {
        try {
            future.complete(fn(err));
        } catch(err) {
            future.fail(err);
        }
    });

    return future;
};
#+end_src

     To be able to use the recovery functionality in monadic sequences, we need to defined a =flatMap= variant as well.

#+begin_src javascript
// flatMapRecover :: Future a|Error -> (Error -> Future b|Error) -> Future b|Error
Future.prototype.flatMapRecover = fn => {
    return this.recover(fn).flatten();
};
#+end_src
