fp-in-js.html
<div id="outline-container-org8f268d7" class="outline-4">
<h4 id="org8f268d7"><span class="section-number-4">1.2.2</span> Error handling</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Instead of throwing the error in <code>readFileF</code> and <code>readDirF</code>, the Future could be augmented with means of expressing failure.
Note that the failure handling logic has to be implemented in all primitive combinators.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">class</span> Future <span style="color: #c5c8c6;">{</span>
    constructor<span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #81a2be;">this</span>.completeSlots = <span style="color: #f0c674;">[]</span>;
        <span style="color: #81a2be;">this</span>.failSlots = <span style="color: #f0c674;">[]</span>;
        <span style="color: #81a2be;">this</span>.completed = <span style="color: #81a2be;">false</span>;
        <span style="color: #81a2be;">this</span>.failed = <span style="color: #81a2be;">false</span>;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">... */</span>

    failed<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">if</span> <span style="color: #f0c674;">(</span><span style="color: #81a2be;">this</span>.failed<span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
            fn<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.error<span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span> <span style="color: #b5bd68;">else</span> <span style="color: #f0c674;">{</span>
            <span style="color: #81a2be;">this</span>.failSlots.push<span style="color: #b5bd68;">(</span>fn<span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>
    <span style="color: #8abeb7;">}</span>

    fail<span style="color: #8abeb7;">(</span>err<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">if</span><span style="color: #f0c674;">(</span><span style="color: #81a2be;">this</span>.completed || <span style="color: #81a2be;">this</span>.failed<span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
            <span style="color: #b5bd68;">throw</span> <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Error</span><span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'Cannot fail an already settled Future!'</span><span style="color: #b5bd68;">)</span>;
        <span style="color: #f0c674;">}</span>

        <span style="color: #81a2be;">this</span>.failed = <span style="color: #81a2be;">true</span>;
        <span style="color: #81a2be;">this</span>.error = err;
        <span style="color: #81a2be;">this</span>.failSlots.forEach<span style="color: #f0c674;">(</span>fn =&gt; fn<span style="color: #b5bd68;">(</span>err<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;
        <span style="color: #81a2be;">this</span>.failSlots = <span style="color: #81a2be;">null</span>;
        <span style="color: #81a2be;">this</span>.slots = <span style="color: #81a2be;">null</span>;
    <span style="color: #8abeb7;">}</span>

    map<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #f0c674;">()</span>;
        <span style="color: #81a2be;">this</span>.ready<span style="color: #f0c674;">(</span>val =&gt; <span style="color: #b5bd68;">{</span>
            <span style="color: #b5bd68;">try</span> <span style="color: #81a2be;">{</span>
                future.complete<span style="color: #c5c8c6;">(</span>fn<span style="color: #8abeb7;">(</span>val<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>;
            <span style="color: #81a2be;">}</span> <span style="color: #b5bd68;">catch</span><span style="color: #81a2be;">(</span>err<span style="color: #81a2be;">)</span> <span style="color: #81a2be;">{</span>
                future.fail<span style="color: #c5c8c6;">(</span>err<span style="color: #c5c8c6;">)</span>;
            <span style="color: #81a2be;">}</span>
        <span style="color: #b5bd68;">}</span><span style="color: #f0c674;">)</span>;

        <span style="color: #81a2be;">this</span>.failed<span style="color: #f0c674;">(</span>err =&gt; future.fail<span style="color: #b5bd68;">(</span>err<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;
        <span style="color: #b5bd68;">return</span> future;
    <span style="color: #8abeb7;">}</span>

    flatten<span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future1</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #f0c674;">()</span>;

        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">If outer fails, we don't care about the result of inner.</span>
        <span style="color: #81a2be;">this</span>.failed<span style="color: #f0c674;">(</span>err =&gt; future1.fail<span style="color: #b5bd68;">(</span>err<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;

        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">If inner fails, we need to fail the result.</span>
        <span style="color: #81a2be;">this</span>.ready<span style="color: #f0c674;">(</span>future2 =&gt; future2.failed<span style="color: #b5bd68;">(</span>err =&gt; future1.fail<span style="color: #81a2be;">(</span>err<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;

        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Happy case.</span>
        <span style="color: #81a2be;">this</span>.ready<span style="color: #f0c674;">(</span>future2 =&gt; future2.ready<span style="color: #b5bd68;">(</span>val =&gt; future1.complete<span style="color: #81a2be;">(</span>val<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;

        <span style="color: #b5bd68;">return</span> future1;
    <span style="color: #8abeb7;">}</span>
<span style="color: #c5c8c6;">}</span>
</pre>
</div>

<p>
What can we do with a failed Future?
There is actually only one thing - we can <i>catch</i> the errors and try to recover from them.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">recover :: Future a|Error -&gt; (Error -&gt; b|Error) -&gt; Future b|Error</span>
Future.<span style="color: #81a2be;">prototype</span>.recover = fn =&gt; <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">const</span> <span style="color: #f0c674;">future</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Future</span><span style="color: #8abeb7;">()</span>;

    <span style="color: #81a2be;">this</span>.ready<span style="color: #8abeb7;">(</span>val =&gt; future.complete<span style="color: #f0c674;">(</span>val<span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span>;

    <span style="color: #81a2be;">this</span>.failed<span style="color: #8abeb7;">(</span>err =&gt; <span style="color: #f0c674;">{</span>
        <span style="color: #b5bd68;">try</span> <span style="color: #b5bd68;">{</span>
            future.complete<span style="color: #81a2be;">(</span>fn<span style="color: #c5c8c6;">(</span>err<span style="color: #c5c8c6;">)</span><span style="color: #81a2be;">)</span>;
        <span style="color: #b5bd68;">}</span> <span style="color: #b5bd68;">catch</span><span style="color: #b5bd68;">(</span>err<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
            future.fail<span style="color: #81a2be;">(</span>err<span style="color: #81a2be;">)</span>;
        <span style="color: #b5bd68;">}</span>
    <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;

    <span style="color: #b5bd68;">return</span> future;
<span style="color: #c5c8c6;">}</span>;
</pre>
</div>

<p>
To be able to use the recovery functionality in monadic sequences, we need to defined a <code>flatMap</code> variant as well.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">flatMapRecover :: Future a|Error -&gt; (Error -&gt; Future b|Error) -&gt; Future b|Error</span>
Future.<span style="color: #81a2be;">prototype</span>.flatMapRecover = fn =&gt; <span style="color: #c5c8c6;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #81a2be;">this</span>.recover<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span>.flatten<span style="color: #8abeb7;">()</span>;
<span style="color: #c5c8c6;">}</span>;
</pre>
</div>
</div>
</div>
