org/fp-in-js.org
*** Side effects
     When computations finish, that's the time to update the UI, save to DB, log to the console etc. - generally, perform IO.
     The problem is that if we want to be purely functional,  we need to return something as a result of this IO operation.
     Another issue is that we may need to wait for the side effect operation to complete and we often need its result.
     These problems point to an obvious solution - IO should be /monadic/ as well.

     
#+begin_src javascript
class IO {
    constructor(io) {
        this.io = io;
    }

    // map :: IO a -> (a -> b) -> IO b
    map(fn) {
        return new IO(() => fn(this.io()));
    }

    // map :: IO a -> (a -> IO b) -> IO b
    flatMap() {
        return new IO(() => fn(this.io()).run());
    }

    // map :: IO a -> a 
    run() {
        this.io();
    }

    // unit :: a -> IO a
    static unit(val) {
        return new IO(() => val);
    }
}
#+end_src

*** Aside: promises
    Promises look similar to Futures - one would just have to merge all the ready/error handling methods into one.
    The clue of the difference lies in the semantics.
    The Promise specification describes /operational/ semantics (i.e. how exactly a Promise implementation should behave) whereas the Future presents a /denotational/ semantics (focusing more on the overall result).
    Promises can be thought of in a more functional context - functions can be lifted into their domain to reduce complexity and provide more referential transparency.

*** TODO Applicative Functors
    
* Followups
** DONE https://medium.com/@yelouafi/from-callback-to-future-functor-monad-6c86d9c16cb5
** TODO https://medium.com/@yelouafi/futures-and-monoids-7e9f4574bd88
