fp-in-js.html
<div id="outline-container-org0bd8787" class="outline-4">
<h4 id="org0bd8787"><span class="section-number-4">1.2.3</span> Side effects</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
When computations finish, that's the time to update the UI, save to DB, log to the console etc. - generally, perform IO.
The problem is that if we want to be purely functional,  we need to return something as a result of this IO operation.
Another issue is that we may need to wait for the side effect operation to complete and we often need its result.
These problems point to an obvious solution - IO should be <i>monadic</i> as well.
</p>


<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">class</span> IO <span style="color: #c5c8c6;">{</span>
    constructor<span style="color: #8abeb7;">(</span>io<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #81a2be;">this</span>.io = io;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">map :: IO a -&gt; (a -&gt; b) -&gt; IO b</span>
    map<span style="color: #8abeb7;">(</span>fn<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">IO</span><span style="color: #f0c674;">(</span><span style="color: #b5bd68;">()</span> =&gt; fn<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.io<span style="color: #81a2be;">()</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">map :: IO a -&gt; (a -&gt; IO b) -&gt; IO b</span>
    flatMap<span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">IO</span><span style="color: #f0c674;">(</span><span style="color: #b5bd68;">()</span> =&gt; fn<span style="color: #b5bd68;">(</span><span style="color: #81a2be;">this</span>.io<span style="color: #81a2be;">()</span><span style="color: #b5bd68;">)</span>.run<span style="color: #b5bd68;">()</span><span style="color: #f0c674;">)</span>;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">map :: IO a -&gt; a </span>
    run<span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #81a2be;">this</span>.io<span style="color: #f0c674;">()</span>;
    <span style="color: #8abeb7;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">unit :: a -&gt; IO a</span>
    <span style="color: #b5bd68;">static</span> unit<span style="color: #8abeb7;">(</span>val<span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
        <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">IO</span><span style="color: #f0c674;">(</span><span style="color: #b5bd68;">()</span> =&gt; val<span style="color: #f0c674;">)</span>;
    <span style="color: #8abeb7;">}</span>
<span style="color: #c5c8c6;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a1679e" class="outline-4">
<h4 id="org8a1679e"><span class="section-number-4">1.2.4</span> Aside: promises</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Promises look similar to Futures - one would just have to merge all the ready/error handling methods into one.
The clue of the difference lies in the semantics.
The Promise specification describes <i>operational</i> semantics (i.e. how exactly a Promise implementation should behave) whereas the Future presents a <i>denotational</i> semantics (focusing more on the overall result).
Promises can be thought of in a more functional context - functions can be lifted into their domain to reduce complexity and provide more referential transparency.
</p>
</div>
</div>

<div id="outline-container-org4e8e3ba" class="outline-4">
<h4 id="org4e8e3ba"><span class="section-number-4">1.2.5</span> <span class="todo TODO">TODO</span> Applicative Functors</h4>
</div>
</div>
</div>

<div id="outline-container-org81af103" class="outline-2">
<h2 id="org81af103"><span class="section-number-2">2</span> Followups</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgad5f1df" class="outline-3">
<h3 id="orgad5f1df"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> <a href="https://medium.com/@yelouafi/from-callback-to-future-functor-monad-6c86d9c16cb5">https://medium.com/@yelouafi/from-callback-to-future-functor-monad-6c86d9c16cb5</a></h3>
</div>
<div id="outline-container-org8d8d83c" class="outline-3">
<h3 id="org8d8d83c"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> <a href="https://medium.com/@yelouafi/futures-and-monoids-7e9f4574bd88">https://medium.com/@yelouafi/futures-and-monoids-7e9f4574bd88</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
